### Задание 1

In [31]:
import numpy as np

a = np.array([[1, 6],[2, 8],[3, 11],[3, 10],[1, 7]])
mean_a = a.mean(axis = 0)
print(mean_a)

[2.  8.4]

### Задание 2

In [35]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

### Задание 3

In [46]:
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])
a_centered_sp = a_centered_sp / (a.shape[0] - 1)
print(a_centered_sp)

2.0

### Задание 4

In [48]:
print(np.cov(a.transpose())[0, 1])

2.0

### Задание 5

In [11]:
import pandas as pd

authors = pd.DataFrame({"author_id": [1, 2, 3], "author_name": ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                    'Толстый и тонкий', 'Дама с собачкой', 'Гроза',
                                    'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]})

### Задание 6

In [15]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 7

In [35]:
authors_price.sort_values(by='price', inplace = True, ascending = False)
authors_price.reset_index(drop = True, inplace = True)
top5 = authors_price.head()
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

### Задание 8

In [78]:
temp = authors_price.groupby('author_name')
price_max = temp['price'].max()
price_min = temp['price'].min()
price_mean = temp['price'].mean()
names = authors['author_name'].copy()
names.sort_values(axis = 0, ascending = True, inplace = True)
names.reset_index(drop = True, inplace = True)
names = pd.DataFrame(names)
names = pd.merge(names, price_min, on = 'author_name', how = 'outer')
names = pd.merge(names, price_max, on = 'author_name', how = 'outer')
authors_stat = pd.merge(names, price_mean, on = 'author_name', how = 'outer')
authors_stat.columns = ['author_name', 'min_price', 'max_price', 'mean_price']
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

### Задание 9

In [103]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(authors_price, values = 'price', columns = 'cover', index = 'author_name')
book_info = pivot.fillna(0)
book_info.to_pickle('book_info.pkl')
book_info_2 = pd.read_pickle('book_info.pkl')
book_info_2

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0

In [99]:
book_info

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0